Revit 2024 API
PerformanceAdviser.GetRuleId Method
 Retrieves an id of a rule for a given index in the list.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public PerformanceAdviserRuleId GetRuleId(
	int index
)
Visual Basic
Public Function GetRuleId ( _
	index As Integer _
) As PerformanceAdviserRuleId
Visual C++
public:
PerformanceAdviserRuleId^ GetRuleId(
	int index
)
Parameters
index
Type: System.Int32
 The index to retrieve the rule id for.
Return Value
 The rule id.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The index is outside of acceptable range.
See Also
PerformanceAdviser Class
Autodesk.Revit.DB Namespace